Merge pull request #5 from Nicopiriz18/feature/readme
fixed diagram
